{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "#": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      "/": 10,
      "1": 11,
      "2": 12,
      "3": 13,
      "4": 14,
      "5": 15,
      "6": 16,
      "7": 17,
      "8": 18,
      "=": 19,
      "@": 20,
      "B": 21,
      "C": 22,
      "F": 23,
      "H": 24,
      "I": 25,
      "N": 26,
      "O": 27,
      "P": 28,
      "S": 29,
      "[": 30,
      "\\": 31,
      "]": 32,
      "c": 33,
      "l": 34,
      "n": 35,
      "o": 36,
      "r": 37,
      "s": 38,
      "cc": 39,
      "CC": 40,
      "c1": 41,
      "(=": 42,
      "c2": 43,
      "c1cc": 44,
      "](": 45,
      "@@": 46,
      "NC": 47,
      "c2cc": 48,
      "c3": 49,
      "CCC": 50,
      "c1ccc": 51,
      ")[": 52,
      "cc1": 53,
      "NH": 54,
      "+]": 55,
      "c1cccc": 56,
      "CO": 57,
      "1CC": 58,
      "c2cccc": 59,
      "n1": 60,
      "Cl": 61,
      "nc": 62,
      "C1": 63,
      "c3cc": 64,
      "2CC": 65,
      "OC": 66,
      "CC1": 67,
      "c2ccc": 68,
      "c2ccccc2": 69,
      "c1ccccc1": 70,
      ")(": 71,
      "(-": 72,
      "CN": 73,
      "([": 74,
      "cc2": 75,
      "n2": 76,
      "-]": 77,
      ")(=": 78,
      "1C": 79,
      "nH": 80,
      "C2": 81,
      "CC2": 82,
      "c1n": 83,
      "1CCC": 84,
      "c3cccc": 85,
      "-])": 86,
      "c1c": 87,
      "c2c": 88,
      "Cc1ccc": 89,
      "+](": 90,
      "NH2": 91,
      "CCO": 92,
      ")=": 93,
      "c3ccccc3": 94,
      "2C": 95,
      "CCN": 96,
      "c4": 97,
      "Cc1cc": 98,
      "N1CC": 99,
      "nn": 100,
      "COc1ccc": 101,
      "2CCC": 102,
      "s1": 103,
      "Br": 104,
      "CNC": 105,
      "CS": 106,
      "c3ccc": 107,
      "N2CC": 108,
      "c2n": 109,
      "ccc1": 110,
      "+](=": 111,
      "c1nc": 112,
      "COC": 113,
      "o1": 114,
      "cc3": 115,
      "3CC": 116,
      "c1C": 117,
      "nc2": 118,
      "cccc": 119,
      "NCC": 120,
      "C1CC": 121,
      "nc1": 122,
      "n3": 123,
      "c3c": 124,
      "+][": 125,
      "Nc1ccc": 126,
      "ccc": 127,
      "Cc1n": 128,
      "CC3": 129,
      "]([": 130,
      "NH3": 131,
      "s2": 132,
      "Cc1c": 133,
      "c2nc": 134,
      "Cn1": 135,
      "ccc2": 136,
      "Cc1cccc": 137,
      "sc": 138,
      "C2CC": 139,
      "N1CCC": 140,
      "C3": 141,
      "OCC": 142,
      "CCC1": 143,
      "1CCN": 144,
      "o2": 145,
      "COc1cc": 146,
      "(/": 147,
      "Cc1ccccc1": 148,
      "CCC2": 149,
      "@]": 150,
      "CCOC": 151,
      "@@]": 152,
      "oc": 153,
      "CCNC": 154,
      "O1": 155,
      "N1C": 156,
      "cc1C": 157,
      "CCn1": 158,
      "Nc1cc": 159,
      "+])": 160,
      "N1CCN": 161,
      "N2CCC": 162,
      "c2ccccc21": 163,
      ")/": 164,
      "c4cccc": 165,
      "N2C": 166,
      "Nc2ccc": 167,
      "N3": 168,
      "Nc1cccc": 169,
      "CCCC": 170,
      "SC": 171,
      "COc1cccc": 172,
      "Cc1nc": 173,
      "ncc": 174,
      "n2c": 175,
      "1CN": 176,
      "c2c1": 177,
      "N1": 178,
      "SCC": 179,
      "C2CC2": 180,
      "cc1F": 181,
      "nc3": 182,
      "COc1ccccc1": 183,
      "c4ccccc4": 184,
      "Cc2ccc": 185,
      "cn1": 186,
      "c12": 187,
      "cc1Cl": 188,
      "Cc2ccccc2": 189,
      "CCS": 190,
      "c1nnc": 191,
      "3C": 192,
      "CCCO": 193,
      "1CCCC": 194,
      "C1CC1": 195,
      "c1ccc2c": 196,
      "nn1": 197,
      "1CCCN": 198,
      "N2CCN": 199,
      "c1ncc": 200,
      "CCC3": 201,
      "c2C": 202,
      "NNC": 203,
      "c2ncc": 204,
      "Nc1ccccc1": 205,
      "CCOc1ccc": 206,
      "OCO": 207,
      "CCN1C": 208,
      "@](": 209,
      "cc1OC": 210,
      "no1": 211,
      "OCC2": 212,
      "OCC1": 213,
      "NS": 214,
      "N2": 215,
      "Nc2cc": 216,
      "nn2": 217,
      "O2": 218,
      "c3nc": 219,
      "Cn1c": 220,
      "CN1C": 221,
      "@@](": 222,
      "cc1NC": 223,
      "OCCO": 224,
      "=[": 225,
      "N3CC": 226,
      "c2nnc": 227,
      "2CCCC": 228,
      "CCc1ccc": 229,
      "cs1": 230,
      "CN2CC": 231,
      "NCc1ccc": 232,
      "n2cc": 233,
      "c4ccc": 234,
      "s3": 235,
      "C3CC": 236,
      "c3ccccc32": 237,
      "ncc2": 238,
      "NCCC": 239,
      "c23": 240,
      "Cn1cc": 241,
      "c1nn": 242,
      "c2cccs2": 243,
      "CCn1c": 244,
      "Nc2cccc": 245,
      "c1cccs1": 246,
      "ccc3": 247,
      "Nc2ccccc2": 248,
      "o3": 249,
      "Cc1nn": 250,
      "1CCO": 251,
      "c2ccccc12": 252,
      "Cc1": 253,
      "c2ccc3c": 254,
      "sc1": 255,
      "c3n": 256,
      "c1cc2": 257,
      "n1C": 258,
      "CCCC2": 259,
      "ncc1": 260,
      "1CC1": 261,
      "1CCCO1": 262,
      "n1c": 263,
      "1NC": 264,
      "c2cccnc2": 265,
      "+]([": 266,
      "Cc2c": 267,
      "c2ccco2": 268,
      "N2CCOCC2": 269,
      "1CCCC1": 270,
      "n2C": 271,
      "NN": 272,
      "c1ccco1": 273,
      "3CCC": 274,
      "CCO1": 275,
      "c2nn": 276,
      "c4c": 277,
      "cccc2": 278,
      "Cc3ccccc3": 279,
      "ccc21": 280,
      "C1CCN": 281,
      "N1CCOCC1": 282,
      "Nc1c": 283,
      "cc4": 284,
      "CCCNC": 285,
      "N2CCCC2": 286,
      "Cc2cc": 287,
      "+]=": 288,
      "c1nc2ccccc2": 289,
      "2CCCO2": 290,
      "1CCS": 291,
      "1CO": 292,
      "2CCN": 293,
      "C3CC3": 294,
      "1CCCCC1": 295,
      "cc2C": 296,
      "-])[": 297,
      "Cc2cccc": 298,
      "C4": 299,
      "NC1": 300,
      "Cc1noc": 301,
      "OC2": 302,
      "Oc1ccc": 303,
      "c2ccccc2C": 304,
      "c2ccccc2F": 305,
      "CCCC1": 306,
      "Cc1csc": 307,
      "c1ccccc1F": 308,
      "2CCCC2": 309,
      "CCCN": 310,
      "c2ccccc2c1": 311,
      "1O": 312,
      "NC2": 313,
      "c1ccccc1C": 314,
      "ccc1C": 315,
      "1c1ccc": 316,
      "c1ccccn1": 317,
      "ccc12": 318,
      "ccc1F": 319,
      "cn2": 320,
      "n4": 321,
      "c2nc3ccccc3": 322,
      "cccn2": 323,
      "c1OC": 324,
      "c1cn": 325,
      "nc12": 326,
      "CCOCC3": 327,
      "c1cccc2": 328,
      "c2cc3": 329,
      "no2": 330,
      "c1ccccc1Cl": 331,
      "c1ccncc1": 332,
      "CC4": 333,
      "2CCCN": 334,
      "nc1C": 335,
      "OCO2": 336,
      "sc2": 337,
      "c1ccccc1NC": 338,
      "n1cc": 339,
      "OCCO2": 340,
      "CN2C": 341,
      "c1cccnc1": 342,
      "n2nc": 343,
      "Cc3ccc": 344,
      "2CCCCC2": 345,
      "c2ccccc2Cl": 346,
      "c5": 347,
      "S1": 348,
      "c2ccccn2": 349,
      "c2cnn": 350,
      "C1C": 351,
      "nnc1": 352,
      "CCCC3": 353,
      "c1NC": 354,
      "sc1C": 355,
      "CCn1cc": 356,
      "nc4": 357,
      "Nc3ccc": 358,
      "2CC2": 359,
      "cc12": 360,
      "c2s": 361,
      "c2ccncc2": 362,
      "Nc1ccc2c": 363,
      "Nc1nc": 364,
      "(\\": 365,
      "cc2Cl": 366,
      "COCC": 367,
      "cc21": 368,
      "cc2F": 369,
      "c3ccccc23": 370,
      "nc2c1": 371,
      "on1": 372,
      "c2cn": 373,
      "c1csc": 374,
      "c1cnc": 375,
      "2C1": 376,
      "N1CCCC1": 377,
      "cs2": 378,
      "ccc1Cl": 379,
      "ccc1NC": 380,
      "c1noc": 381,
      "N3CCC": 382,
      "CN1CC": 383,
      "N4": 384,
      "ccc1OC": 385,
      "Cc1ncc": 386,
      "NCc2ccc": 387,
      ")([": 388,
      "c3cccs3": 389,
      "C1CCCC1": 390,
      "c1F": 391,
      "21": 392,
      "sc2c1": 393,
      "OCO3": 394,
      "CCc1nn": 395,
      "n3c": 396,
      "32": 397,
      "C1CCC": 398,
      "C1CCCCC1": 399,
      "CNS": 400,
      "ncc3": 401,
      "CN1CCN": 402,
      "2c": 403,
      "CCCO3": 404,
      "nn1C": 405,
      "@@](=": 406,
      "c2ccccc2C1": 407,
      "2CO": 408,
      "CCCCC": 409,
      "c3ccc4c": 410,
      "c1cnn": 411,
      "Cc1ccc2c": 412,
      "CCO2": 413,
      "c1O": 414,
      "c3c2": 415,
      "N3CCCC3": 416,
      "CCOc1cc": 417,
      "CSC": 418,
      "CCc1cc": 419,
      "cccc3": 420,
      "c2csc": 421,
      "c2noc": 422,
      "Cn2c": 423,
      "cc1S": 424,
      "c3ccccc3C": 425,
      "ccccc4": 426,
      "c3cccnc3": 427,
      "COc1ccc2c": 428,
      "Cc1nnc": 429,
      "c1Cl": 430,
      "N2CCCCC2": 431,
      "ccccc2": 432,
      "Oc2ccc": 433,
      "2CN": 434,
      "c1s": 435,
      "-])=": 436,
      "C2CCN": 437,
      "c3ncc": 438,
      "c3C": 439,
      "c3ccco3": 440,
      "@](=": 441,
      "Nc2nc": 442,
      "ncn2": 443,
      "N3CCOCC3": 444,
      "c3nc4": 445,
      "1S": 446,
      "COc2ccc": 447,
      "nc2ccccc21": 448,
      "n2cccn2": 449,
      "ccc2C": 450,
      "c1cc2c": 451,
      "no": 452,
      "3CCCC": 453,
      "cc2c1": 454,
      "n12": 455,
      "1c1ccccc1": 456,
      "ccc1O": 457,
      "Nc1n": 458,
      "cc1Br": 459,
      "C2C": 460,
      "/[": 461,
      "N3C": 462,
      "c3ccccn3": 463,
      "c1N": 464,
      "CSc1ccc": 465,
      "c1cncc": 466,
      "OCCO3": 467,
      "ccccc12": 468,
      "CCCCC2": 469,
      "2CCS": 470,
      "c3ccccc3c2": 471,
      "C2CCCC2": 472,
      "3CCCO3": 473,
      "c2sc": 474,
      "CCCCC1": 475,
      "nnn1": 476,
      "ccccc3": 477,
      "C2CCCCC2": 478,
      "cccn1": 479,
      "N3CCN": 480,
      "3C2": 481,
      "c3ccccc3F": 482,
      "CN2CCN": 483,
      "2CCO": 484,
      "cccn3": 485,
      "CSCC": 486,
      "c2cnc": 487,
      "CCn1nc": 488,
      "OC3": 489,
      "2O": 490,
      "NCC1": 491,
      "Cc1cnc": 492,
      "c3nnc": 493,
      "N1CCCCC1": 494,
      "CCN2C": 495,
      "CCc1nc": 496,
      "N1CCO": 497,
      "n1CC": 498,
      "nn3": 499,
      "Cn1nc": 500,
      "S2": 501,
      "n3cc": 502,
      "cc1O": 503,
      "c1nccs1": 504,
      "c2cccc3": 505,
      "CCOc1ccccc1": 506,
      "oc1": 507,
      "CCc1ccccc1": 508,
      "ncn1": 509,
      "c4cc": 510,
      "CSc1nnc": 511,
      "CCc1cccc": 512,
      "Cc1cccs1": 513,
      "NCc1cc": 514,
      "12": 515,
      "nc2C": 516,
      "1CCCN1C": 517,
      "3CCCC3": 518,
      "n3C": 519,
      "CCOc1cccc": 520,
      "Nc2c": 521,
      "2CCCN2C": 522,
      "sc3": 523,
      "+])[": 524,
      "CCCN1C": 525,
      "Oc1cccc": 526,
      "1CS": 527,
      "1Cc2ccccc2": 528,
      "c1ccn": 529,
      "NCc1ccccc1": 530,
      "NCCN": 531,
      "c3ccncc3": 532,
      "Nc1nnc": 533,
      "nn2C": 534,
      "CCCS": 535,
      "CC1CC": 536,
      "NC1CC1": 537,
      "c2nc3c": 538,
      "cccc1Cl": 539,
      "c1sc": 540,
      "c1ccsc1": 541,
      "N1CCCC": 542,
      "CCCC4": 543,
      "1c1cccc": 544,
      "CCl": 545,
      "ccn1": 546,
      "OC1": 547,
      "cc2C1": 548,
      "Cc1cc2": 549,
      "nc2n1": 550,
      "c2cc3c": 551,
      "1OCC": 552,
      "on2": 553,
      "Nc2ccc3c": 554,
      "oc2": 555,
      "1CCCCN1C": 556,
      "ccc2F": 557,
      "nc2c": 558,
      "oc2c1": 559,
      "NC2CC2": 560,
      "nnc": 561,
      "CCc1n": 562,
      "NC3": 563,
      "cccc1F": 564,
      "CSc1n": 565,
      "1CCOC1": 566,
      "2NC": 567,
      "nc21": 568,
      "4CC": 569,
      "c2ccsc2": 570,
      "CC1CCN": 571,
      "Nc1ccccc1C": 572,
      "c2ncccn2": 573,
      "c2nccs2": 574,
      "Cc1ccsc1": 575,
      "c3ccccc3C2": 576,
      "c2n1": 577,
      "2CS": 578,
      "Nc3ccccc3": 579,
      "1N": 580,
      "Cn2cc": 581,
      "CCNS": 582,
      "Cn2": 583,
      "CCCO2": 584,
      "Cc1ccco1": 585,
      "cccc1": 586,
      "3CC3": 587,
      "4C": 588,
      "NCCNC": 589,
      "Cc1ccccc1C": 590,
      "c2cncc": 591,
      "3CCCCC3": 592,
      "Nc3cccc": 593,
      "NCc1cccc": 594,
      "OCO4": 595,
      "Cc2nc": 596,
      "nc2cc": 597,
      "Cc1cnn": 598,
      "CCN1CC": 599,
      "CCc1c": 600,
      "c1cc2ccccc2": 601,
      "c32": 602,
      "c1o": 603,
      "c2ccccc2n1": 604,
      "nc23": 605,
      "CCOCC1": 606,
      "Cc1cccc2": 607,
      "N3CCCCC3": 608,
      "CSc2nnc": 609,
      "2c2ccc": 610,
      "Cc3c": 611,
      "1CCOC2": 612,
      "CCCn1c": 613,
      ")=[": 614,
      "N2CCCC": 615,
      "ccc2Cl": 616,
      "Nc2ccccc2C": 617,
      "c4ccccc43": 618,
      "OCCC": 619,
      "c3nc4ccccc4": 620,
      "Oc1ccccc1": 621,
      "c2nc3ccccc3s2": 622,
      "2N": 623,
      "cc32": 624,
      "ccccc23": 625,
      "c2oc": 626,
      "Cc1cccnc1": 627,
      "c1nc2ccccc2s1": 628,
      "NC1CCCCC1": 629,
      "c21": 630,
      "ccc1Br": 631,
      "Sc1nnc": 632,
      "Oc2ccccc2": 633,
      "1OC": 634,
      "c3ccccc3Cl": 635,
      "c3s": 636,
      "SC1": 637,
      "NCc2cc": 638,
      "c2o": 639,
      "CO2": 640,
      "COCCN": 641,
      "Nc3cc": 642,
      "ccccc5": 643,
      "COc1c": 644,
      "C1N": 645,
      "COc1ccccc1C": 646,
      "COc1ccccc1NC": 647,
      "Cc1o": 648,
      "CSc1nc": 649,
      "nc2s": 650,
      "n2cncn2": 651,
      "c2ccccc2O1": 652,
      "n2cnn": 653,
      "N2CCO": 654,
      "ccc32": 655,
      "c34": 656,
      "Cc1ccccc1NC": 657,
      "c3nn": 658,
      "c2c1C": 659,
      "no3": 660,
      "1CCCCC": 661,
      "ccc2c1": 662,
      "3CCN": 663,
      "n1nc": 664,
      "oc1C": 665,
      "Cc1ccccn1": 666,
      "CCc2ccccc2": 667,
      "n3nc": 668,
      "Fc1ccc": 669,
      "O3": 670,
      "c1ccc2ccccc2c1": 671,
      "n2CC": 672,
      "CCCCNC": 673,
      "c2Cl": 674,
      "CCCc1cc": 675,
      "c1CC": 676,
      "Cc1nc2ccccc2": 677,
      "Cc2ccco2": 678,
      "CN1CCC": 679,
      "CN2CCC": 680,
      "2CCOC2": 681,
      "c1cccc2ccccc12": 682,
      "FC": 683,
      "n2ccnc2": 684,
      "CCOCC": 685,
      "CCC4": 686,
      "2C3": 687,
      "c1ccnc": 688,
      "2c2ccccc2": 689,
      "(\\[": 690,
      "Cc3cccc": 691,
      "cc3C": 692,
      "Cc3cc": 693,
      "n2n1": 694,
      "cc1N": 695,
      "cccc2Cl": 696,
      "cn": 697,
      "NCc2ccccc2": 698,
      "1CCc2c": 699,
      "n1cccn1": 700,
      "2CCOCC2": 701,
      "NCC2": 702,
      "cn3": 703,
      "CCCCN": 704,
      "NC1CC": 705,
      "COCCNC": 706,
      "Cc4ccccc4": 707,
      "CCCOc1ccc": 708,
      "COc1cccc2": 709,
      "NC1CCCC1": 710,
      "2CC3CC": 711,
      "cc23": 712,
      "C4CC4": 713,
      "CN2CCOCC2": 714,
      "CCc1noc": 715,
      "c1nc2c": 716,
      "c1CCC": 717,
      "c3cnn": 718,
      "cnn1C": 719,
      "sc2nc": 720,
      "Cc1cc2c": 721,
      "ccc4": 722,
      "c2C1": 723,
      "nc2ccccc12": 724,
      "1COc2ccccc2O1": 725,
      "CCCO1": 726,
      "n3cccn3": 727,
      "Cc1cn": 728,
      "cccc2F": 729,
      "NCc2cccc": 730,
      "Cc1ccc2nc": 731,
      "N2CCCCCC2": 732,
      "CCCn1cc": 733,
      "c1ccccc1OC": 734,
      "n23": 735,
      "SCC1": 736,
      "cc1CNC": 737,
      "Nc1cccc2": 738,
      "CN1CCO": 739,
      "Cc2cccs2": 740,
      "n2cccc2": 741,
      "NCc1ccco1": 742,
      "Nc2nnc": 743,
      "c1ncccc1C": 744,
      "CCCCC4": 745,
      "s4": 746,
      "CCN1CCN": 747,
      "c3ncccn3": 748,
      "cnn1": 749,
      "1C2": 750,
      "c2F": 751,
      "CCCCC3": 752,
      "1CCOCC1": 753,
      "Nc1cccnc1": 754,
      "N1CCC2": 755,
      "n2nn": 756,
      "Cc2csc": 757,
      "c5ccccc5": 758,
      "Cc1ccnc": 759,
      "cc2s1": 760,
      "C1NC": 761,
      "COc1cc2c": 762,
      "c2ccccn12": 763,
      "3CCOCC3": 764,
      "n1nn": 765,
      "C1CCOCC1": 766,
      "ncn3": 767,
      "c3cc4": 768,
      "n2c1": 769,
      "ccc23": 770,
      "CCc1nnc": 771,
      "c2N": 772,
      "CCN1": 773,
      "C1CCC1": 774,
      "CCOCC4": 775,
      "c1ccccc1Br": 776,
      "nn3C": 777,
      "nn12": 778,
      "nc3ccccc32": 779,
      "CC1CCC": 780,
      "Nc1cnn": 781,
      "nc3c": 782,
      "n1C1CC1": 783,
      "c4ccccc34": 784,
      "1Cc1ccccc1": 785,
      "NCCO": 786,
      "CNc1ccc": 787,
      "N1CCc2cc": 788,
      "nc3c2": 789,
      "cccc1NC": 790,
      "1CCCCCC1": 791,
      "c2sccc2": 792,
      "CC1CC1": 793,
      "OCCCO2": 794,
      "C1CN": 795,
      "CCOCC2": 796,
      "c2nnnn2": 797,
      "CNc2ccc": 798,
      "c2ncn": 799,
      "C3CCCCC3": 800,
      "c2cccnc21": 801,
      "CN1": 802,
      "N1CCc2ccccc21": 803,
      "Cc1oc": 804,
      "Oc2cc": 805,
      "1CCCCO1": 806,
      "Cn1ccc": 807,
      "Cc1ccccc1F": 808,
      "c2cc3ccccc3": 809,
      "N1c1ccc": 810,
      "o4": 811,
      "Oc2cccc": 812,
      "cc1OCC": 813,
      "C3CCCC3": 814,
      "c1ccc2": 815,
      "ccc1N": 816,
      "NC1CCN": 817,
      "c2nc3ccc": 818,
      "NCCc1ccc": 819,
      "NC2CCCCC2": 820,
      "+])(": 821,
      "c1ncnc": 822,
      "Cn2nc": 823,
      "c2ccccc2OC": 824,
      "Cc1ccn": 825,
      "N1CCCN": 826,
      "Cc2ccccn2": 827,
      "12CC": 828,
      "CCO3": 829,
      "SCC2": 830,
      "cccc1C": 831,
      "1CCCc2ccccc21": 832,
      "Cc2cccnc2": 833,
      "Nc3nc": 834,
      "c1CNC": 835,
      "c2nccc": 836,
      "N1CCOC": 837,
      "nc2c1c": 838,
      "SC2": 839,
      "c3ccccc3n2": 840,
      "OCCO4": 841,
      "cc3F": 842,
      "Cn1ncc2": 843,
      "Cc1sc": 844,
      "OCc2ccccc2": 845,
      "Nc1nc2c": 846,
      "23": 847,
      "OCCN": 848,
      "c2ccccc2N": 849,
      "N1CCCCCC1": 850,
      "c4nc": 851,
      "cc3C2": 852,
      "c1ccccc1O": 853,
      "oc2cc": 854,
      "2CO1": 855,
      "Sc2ccc": 856,
      "c1ccccc12": 857,
      "c2nc3cc": 858,
      "nc2ccccc2c1": 859,
      "Nc1ncc": 860,
      "2CCCCCC2": 861,
      "ccc1OCC": 862,
      "ccc2OC": 863,
      "ccc2o1": 864,
      "NC2CC": 865,
      "c2ccnc": 866,
      "CO1": 867,
      "1CNC": 868,
      "Nc1ccccc1F": 869,
      "CN2CCO": 870,
      "c2sc3c": 871,
      "NCc3ccc": 872,
      "NC3CC3": 873,
      "Clc1ccc": 874,
      "nc2s1": 875,
      "c2cnccn2": 876,
      "CCc1ccccc1NC": 877,
      "NCCS": 878,
      "NCc1cccnc1": 879,
      "NCCCC": 880,
      "cccnc12": 881,
      "n3ccnc3": 882,
      "oc12": 883,
      "c2ccccc2O": 884,
      "n2cnnn2": 885,
      "2S": 886,
      "c2n1CC": 887,
      "C2CCOCC2": 888,
      "noc2C": 889,
      "cc3Cl": 890,
      "CN1CCOCC1": 891,
      "Cc1ccccc1Cl": 892,
      "c1ccoc1": 893,
      "c4ccco4": 894,
      "cccc21": 895,
      "c2ccoc2": 896,
      "Cn1ccnc1": 897,
      "c1cc2ccccc2o1": 898,
      "Oc1cc": 899,
      "Cc1ccncc1": 900,
      "c3cncc": 901,
      "c2cc1C": 902,
      "c2ncnc": 903,
      "CNc1cc": 904,
      "c2ncnc3": 905,
      "Cn1nn": 906,
      "12C": 907,
      "NC1CCC": 908,
      "c2ccn": 909,
      "c2ccc3ccccc3c2": 910,
      "CCCOC": 911,
      "Cc2ccccc2F": 912,
      "CSc1cccc": 913,
      "Cc1nc2c": 914,
      "Cc1cncc": 915,
      "Cc2ccccc2Cl": 916,
      "CCc3ccccc3": 917,
      "COc2ccccc2": 918,
      "n3n2": 919,
      "sc2n1": 920,
      "CC2CC2": 921,
      "COC2": 922,
      "Nc1nccs1": 923,
      "Sc1n": 924,
      "oc2ccccc12": 925,
      "c3ccsc3": 926,
      "OCc2ccc": 927,
      "CCOc1c": 928,
      "ccc2n1": 929,
      "5c": 930,
      "NCc1nc": 931,
      "c3n2": 932,
      "c2cccc3ccccc23": 933,
      "3c": 934,
      "Nc4ccc": 935,
      "CCc2ccc": 936,
      "COCCN1C": 937,
      "c2cs": 938,
      "cc3c": 939,
      "n3cncn3": 940,
      "OCc1ccccc1": 941,
      "C2CCC": 942,
      "1c1cc": 943,
      "Sc1ccc": 944,
      "nc2nc": 945,
      "NCCc1c": 946,
      "Cc1nc2cc": 947,
      "2c2cccc": 948,
      "3CS": 949,
      "nnc3": 950,
      "c2O": 951,
      "3CCCN": 952,
      "N4CCOCC4": 953,
      "2CCOC3": 954,
      "nc32": 955,
      "Cc2nnc": 956,
      "c2c3c": 957,
      "NCc1ccc2c": 958,
      "COCc1cc": 959,
      "cc2c": 960,
      "(=[": 961,
      "NC2CCCC2": 962,
      "1CCCCN": 963,
      "cc3s2": 964,
      "oc3": 965,
      "NCc1c": 966,
      "NCc2ccco2": 967,
      "n1n": 968,
      "c3cccc4": 969,
      "Cc1cs": 970,
      "c1oc": 971,
      "c2nnn": 972,
      "c1S": 973,
      "COc2cccc": 974,
      "2CCCCC": 975,
      "c4cccs4": 976,
      "c1cnccn1": 977,
      "Cc2ccc3c": 978,
      "nc2sc": 979,
      "Cn1n": 980,
      "ccc2O": 981,
      "c3sc": 982,
      "CCOc1ccccc1NC": 983,
      "c1nnc2ccccn12": 984,
      "c1nc2ccccc2c": 985,
      "CCSC": 986,
      "Nc2cnn": 987,
      "n1cccc1": 988,
      "c1nc2cc": 989,
      "c3ccccc3O2": 990,
      "c1Br": 991,
      "Nc1ccccc1Cl": 992,
      "nc2ccc": 993,
      "2CCC2": 994,
      "CS2": 995,
      "oc2C": 996,
      "n1N": 997,
      "N4CCCC4": 998,
      "c3nccs3": 999,
      "N1CCc2c": 1000,
      "N2CCCN": 1001,
      "cn12": 1002,
      "c2ncccc2C": 1003,
      "1c1cccs1": 1004,
      "cnc12": 1005,
      "OC2CCCC2": 1006,
      "nnc2": 1007,
      "3CCS": 1008,
      "CCCO4": 1009,
      "C2CCC2": 1010,
      "C3C": 1011,
      "c4ccccc4c3": 1012,
      "c1cs": 1013,
      "c1C1CC1": 1014,
      "n1cncn1": 1015,
      "CN3C": 1016,
      "c3noc": 1017,
      "NCCN1C": 1018,
      "CCc1ncc": 1019,
      "c1nc2ccc": 1020,
      "CCOC2": 1021,
      "N1N": 1022,
      "nc3C": 1023,
      "1COCCN1C": 1024,
      "noc1C": 1025,
      "n2nnnc2": 1026,
      "c2ncccc2c1": 1027,
      "Nc3c": 1028,
      "c2ccccc2Br": 1029,
      "cc2Br": 1030,
      "2c3c": 1031,
      "Nc1s": 1032,
      "c2ccccc2NC": 1033,
      "1C1CC1": 1034,
      "ccc3C": 1035,
      "c1OCC": 1036,
      "CNc1nc": 1037,
      "CSC1": 1038,
      "3CC4CC": 1039,
      "COc1ccc2nc": 1040,
      "Cn1cnc": 1041,
      "c1cc2cccc": 1042,
      "N2CCOC": 1043,
      "N1S": 1044,
      "n1Cc1ccccc1": 1045,
      "nn32": 1046,
      "Cn1cccn1": 1047,
      "N1c1ccccc1": 1048,
      "Cc2cnc": 1049,
      "c2nnc3n": 1050,
      "cs3": 1051,
      "N1CCc2ccccc2C1": 1052,
      "N2CCC3": 1053,
      "c4cccnc4": 1054,
      "ccccc34": 1055,
      "NO": 1056,
      "c1ccc2nc": 1057,
      "c4c3": 1058,
      "2CCCN2": 1059,
      "Cc2cccc3": 1060,
      "Sc1nc": 1061,
      "CN3CCOCC3": 1062,
      "1Cc2cc": 1063,
      "Nc3ccc4c": 1064,
      "cnc1": 1065,
      "CCc1cnc": 1066,
      "NC4": 1067,
      "COCCC": 1068,
      "N1CCc2ccc": 1069,
      "Nn1c": 1070,
      "on3": 1071,
      "NCC1CCN": 1072,
      "3O": 1073,
      "ccn2": 1074,
      "c1nnn": 1075,
      "CS1": 1076,
      "N3CCCCCC3": 1077,
      "Nc2cccc3": 1078,
      "c5ccc": 1079,
      "3CCO": 1080,
      "COCc1ccc": 1081,
      "1CCc2ccccc21": 1082,
      "1CCc2ccccc2C1": 1083,
      "C12CC3CC": 1084,
      "Nc2ccccc2F": 1085,
      "COc3ccc": 1086,
      "Cc1ccccc1O": 1087,
      "NCc1cccs1": 1088,
      "nc2sc3c": 1089,
      "n3cccc3": 1090,
      "COc1ccc2cc": 1091,
      "c2nc3ccccc3o2": 1092,
      "sc2cc": 1093,
      "COC1": 1094,
      "n1ncc": 1095,
      "ccc1S": 1096,
      "Nc2cccnc2": 1097,
      "CCCN2C": 1098,
      "CCOc1ccccc1C": 1099,
      "cccc4": 1100,
      "c4ccccc4C": 1101,
      "Sc2nnc": 1102,
      "CCSC2": 1103,
      "c1ccccc1N": 1104,
      "c2nccn2C": 1105,
      "Cc1sc2nc": 1106,
      "Oc3ccc": 1107,
      "ncc1C": 1108,
      "CNc2cc": 1109,
      "c3ccccc3OC": 1110,
      "COc1ccccc1CNC": 1111,
      "Cc2ccncc2": 1112,
      "COc1ncc": 1113,
      "COCCCNC": 1114,
      "n3ccccc3": 1115,
      "c1cc2cc": 1116,
      "n4c": 1117,
      "CCCc1nc": 1118,
      "cc2OC": 1119,
      "Cc1nccn1": 1120,
      "nc3cc": 1121,
      "2CCCCO2": 1122,
      "-])/": 1123,
      "CSc2nc": 1124,
      "Nc1ccnn1": 1125,
      "c4ccccc4C3": 1126,
      "c3cnccn3": 1127,
      "OCCCO3": 1128,
      "NCc2cccnc2": 1129,
      "COCCn1c": 1130,
      "CSc2ccc": 1131,
      "NCCC1": 1132,
      "SCCC": 1133,
      "COc2cc": 1134,
      "N1CC2": 1135,
      "2CCCc3ccccc32": 1136,
      "NCCc1ccccc1": 1137,
      "cccn4": 1138,
      "n1nnnc1": 1139,
      "CCCl": 1140,
      "c3ccccn23": 1141,
      "c3csc": 1142,
      "ncc4": 1143,
      "CCSC1": 1144,
      "sc2C": 1145,
      "Nc1ccc2": 1146,
      "c3nc4ccccc4s3": 1147,
      "1c2ccccc2C": 1148,
      "c4n": 1149,
      "nn23": 1150,
      "2c3ccccc3C": 1151,
      "Oc3ccccc3": 1152,
      "CN3CC": 1153,
      "CSC2": 1154,
      "n4cc": 1155,
      "CCc1ccsc1": 1156,
      "Nc1nc2ccc": 1157,
      "Fc1cccc": 1158,
      "1Cc1ccc": 1159,
      "nc2scc": 1160,
      "3CO": 1161,
      "NN2C": 1162,
      "CCc2c": 1163,
      "c1cnn2": 1164,
      "COC3": 1165,
      "c3cn": 1166,
      "N12": 1167,
      "c2nnc3n2CC": 1168,
      "\\[": 1169,
      "CCc1o": 1170,
      "1CCC2": 1171,
      "Cc1ccc2": 1172,
      "cc3c2": 1173,
      "c1nc2ccccc2n1C": 1174,
      "1CCCCN1S": 1175,
      "Nc2ncc": 1176,
      "c3o": 1177,
      "COC1CCN": 1178,
      "Cc1no": 1179,
      "c4ccccn4": 1180,
      "Nc2ccc3": 1181,
      "c1nnc2n1CC": 1182,
      "cccc2C": 1183,
      "nnc1S": 1184,
      "Cc4ccc": 1185,
      "Cn2cccn2": 1186,
      "CC1CCCCC1": 1187,
      "OCc1ccc": 1188,
      "C3CCN": 1189,
      "NCc1ccnc": 1190,
      "1COC": 1191,
      "Nc2cn": 1192,
      "CCn2c": 1193,
      "COc1nc": 1194,
      "NCCc2ccc": 1195,
      "1Cc2ccccc2O1": 1196,
      "nc3ccccc23": 1197,
      "nc3s": 1198,
      "c1c2c": 1199,
      "c1coc": 1200,
      "Cc2ccccc2C1": 1201,
      "n2cnnc2": 1202,
      "C5": 1203,
      "OCc3ccccc3": 1204,
      "1CSCC": 1205,
      "N2CCc3ccccc32": 1206,
      "cccnc23": 1207,
      "Cc1nc2ccc": 1208,
      "1CN2CCCC": 1209,
      "ccc3c2": 1210,
      "ccc3C2": 1211,
      "CC1CCCC1": 1212,
      "c3ccccc3O": 1213,
      "c2no": 1214,
      "2COc3ccccc3O2": 1215,
      "c3cccnc32": 1216,
      "1CC2": 1217,
      "n1ncc2": 1218,
      "nn4": 1219,
      "OCCNC": 1220,
      "CCc1cccs1": 1221,
      "Cc1nccs1": 1222,
      "1c1ccco1": 1223,
      "Nc2nccs2": 1224,
      "NCc2c": 1225,
      "c3C2": 1226,
      "CCCc1ccc": 1227,
      "CC1CCC1": 1228,
      "n2ccccc2": 1229,
      "3CCOC3": 1230,
      "Cn1ncc": 1231,
      "1CCOc2ccccc21": 1232,
      "Cc3cccnc3": 1233,
      "Cc3cccs3": 1234,
      "4CCCO4": 1235,
      "Nc3ccccc3C": 1236,
      "c1CN": 1237,
      "CCN3C": 1238,
      "COc1ccc2": 1239,
      "cn1C": 1240,
      "Cc2ccccc2C": 1241,
      ")-": 1242,
      "Nc2nc3c": 1243,
      "CCCCn1c": 1244,
      "NCc3ccccc3": 1245,
      "Cc3ccco3": 1246,
      "nc4ccccc4": 1247,
      "4CCCC": 1248,
      "Nc2ccccc21": 1249,
      "c1ccc2ccccc2n1": 1250,
      "ncnc1": 1251,
      "2CCCCN2C": 1252,
      "CN3CCN": 1253,
      "CCOCCN": 1254,
      "CCN1CCO": 1255,
      "ccc2O1": 1256,
      "c4ccccc4F": 1257,
      "c2cnn3": 1258,
      "Cc1cc2nc": 1259,
      "CCc1nc2n": 1260,
      "12CCC": 1261,
      "Oc2ccccc21": 1262,
      "c2ccc3": 1263,
      "c2ccccc2c1C": 1264,
      "2Cc3ccccc3": 1265,
      "n2ccnn2": 1266,
      "Oc1ccc2c": 1267,
      "NC2CCN": 1268,
      "CCC1CCC": 1269,
      "CCCCS": 1270,
      "Nc1cn": 1271,
      "c2scc": 1272,
      "Cc1occc1C": 1273,
      "CBr": 1274,
      "+]\\": 1275,
      "n2ncc": 1276,
      "c2sccc2C": 1277,
      "sc2c1CCCC2": 1278,
      "c4ccncc4": 1279,
      "sc3c2": 1280,
      "n1ccc": 1281,
      "cc2NC1": 1282,
      "Nc1ccn": 1283,
      "nnc1SCC": 1284,
      "Cc1onc": 1285,
      "1c1nc": 1286,
      "COCc1cccc": 1287,
      "CCCCCC": 1288,
      "SCc2ccc": 1289,
      "nc3nc": 1290,
      "Nc3": 1291,
      "](/": 1292,
      "Cc1ccccc1OCC": 1293,
      "c2nc3ccccc3c": 1294,
      "Cn1ncnc1": 1295,
      "c2sccc2C1": 1296,
      "CCc1onc": 1297,
      "4CCC": 1298,
      "nc3ccccc3c2": 1299,
      "CSc1ncc": 1300,
      "Nc1ccc2nc": 1301,
      "n1ccnc1": 1302,
      "1Cc2ccccc2N1C": 1303,
      "NCc2nc": 1304,
      "NCc2ccc3c": 1305,
      "c3ccoc3": 1306,
      "c1nnc2n1": 1307,
      "N3CCCC": 1308,
      "sc2C1": 1309,
      "1SC": 1310,
      "N1CCS": 1311,
      "C1CCSCC1": 1312,
      "c3nnc4": 1313,
      "c1cccc2cccnc12": 1314,
      "c2nnc3n2CCCCC3": 1315,
      "Cc2noc": 1316,
      "Oc1ccccc1C": 1317,
      "sc3nc": 1318,
      "NC2CCC": 1319,
      "CO3": 1320,
      "C1c2ccccc2C": 1321,
      "n2ccc": 1322,
      "CCOC1": 1323,
      "c2cc3ccccc3o2": 1324,
      "OS": 1325,
      "ccn1C": 1326,
      "NC3CCCC3": 1327,
      "c2ccccc23": 1328,
      "CNc1cccc": 1329,
      "cc2NC": 1330,
      "ccc2N1": 1331,
      "1COc2ccccc21": 1332,
      "COc1cccc2cc": 1333,
      "1SCC": 1334,
      "2OCC": 1335,
      "3CO2": 1336,
      "Cc3ccccn3": 1337,
      "COCCn1cc": 1338,
      "CN2CCCC2": 1339,
      "N4CCC": 1340,
      "Cc3nc": 1341,
      "NCCCO": 1342,
      "Sc1ccccc1": 1343,
      "oc2ccccc21": 1344,
      "NCc1ccccn1": 1345,
      "NCc1csc": 1346,
      "cc2O": 1347,
      "1CCCN1S": 1348,
      "Cc1ccc2ncc": 1349,
      "CCOC3": 1350,
      "Nc1ccccn1": 1351,
      "CCSc1ccc": 1352,
      "Cn3c": 1353,
      "S3": 1354,
      "CCCCN1C": 1355,
      "Cc2ccsc2": 1356,
      "CCCn1nc": 1357,
      "n2N": 1358,
      "n2C2CC2": 1359,
      "c2cc3cc": 1360,
      "NO1": 1361,
      "NCc1ccccc1Cl": 1362,
      "NC3CCCCC3": 1363,
      "c1ccccc1S": 1364,
      "c1nnnn1": 1365,
      "N2CCOC2": 1366,
      "nc1N": 1367,
      "Nc1cccc2ccccc12": 1368,
      "2OC": 1369,
      "c13": 1370,
      "NC1CCCCCC1": 1371,
      "cc1CN": 1372,
      "c3cnc": 1373,
      "Nc1ccccc1OC": 1374,
      "c2nn3c": 1375,
      "c1nnc2n1CCCCC2": 1376,
      "@]([": 1377,
      "Sc2ccccc2": 1378,
      "ccn2C": 1379,
      "CCOc1ccc2c": 1380,
      "N1CSC": 1381,
      "N2N": 1382,
      "1CCSC1": 1383,
      "sc3n2": 1384,
      "c3cc4ccccc4": 1385,
      "n1nccc1NC": 1386,
      "4C3": 1387,
      "CCc2nc": 1388,
      "c2c1nc": 1389,
      "CN2": 1390,
      "CCOc2ccc": 1391,
      "2C2CC2": 1392,
      "nnn3": 1393,
      "CCn1nn": 1394,
      "CCSc1nnc": 1395,
      "Cc3ccccc3F": 1396,
      "Cc1cccc2ccccc12": 1397,
      "1c1ccc2c": 1398,
      "3N": 1399,
      "CC2CCCCC2": 1400,
      "C1O": 1401,
      "1CCCO": 1402,
      "N2CCc3ccccc3C2": 1403,
      "Cc2cnn": 1404,
      "c3cc4c": 1405,
      "CON": 1406,
      "2CC3": 1407,
      "cc2N": 1408,
      "cc2o1": 1409,
      "c1cccc2c1N": 1410,
      "Nc1sc2c": 1411,
      "Fc1cc": 1412,
      "sc4": 1413,
      "+]/": 1414,
      "cc2N1": 1415,
      "2Cc2ccccc2": 1416,
      "Cc1ccsc1C": 1417,
      "Cc1nnnn1": 1418,
      "N1CCCc2cc": 1419,
      "1CN2CCC": 1420,
      "COc1ccccc1N1CCN": 1421,
      "c3nc4c": 1422,
      "c1scnc1C": 1423,
      "Oc3cc": 1424,
      "CC2CC": 1425,
      "NCc3ccco3": 1426,
      ")(/": 1427,
      "COc1cc2": 1428,
      "Cc1ccccc1CNC": 1429,
      "Cc1ncsc1": 1430,
      "N1c1cccc": 1431,
      "c1cc2n": 1432,
      "Nc1cnc": 1433,
      "NN1C": 1434,
      "@@]([": 1435,
      "CCOc1cc2c": 1436,
      "NCC2CCN": 1437,
      "Cc1cn2c": 1438,
      "Cn1cncn1": 1439,
      "Nc2ccccc2Cl": 1440,
      "1c1ccccc1F": 1441,
      "OCc2nc": 1442,
      "2CCCc3cc": 1443,
      "c1ncn": 1444,
      "COCc1nc": 1445,
      "ccc2n1C": 1446,
      "CCn1ccc": 1447,
      "1CSCN1C": 1448,
      "cnn2": 1449,
      "cnc21": 1450,
      "ns": 1451,
      "CC3CC3": 1452,
      "cc1c32": 1453,
      "n2nnc": 1454,
      "CCCOc1cccc": 1455,
      "Fc1ccccc1": 1456,
      "CCN1CCOCC1": 1457,
      "5ccccc5": 1458,
      "Nc2sc3c": 1459,
      "cnc2c1": 1460,
      "CCCc1c": 1461,
      "n2ncc3": 1462,
      "nc34": 1463,
      "c2nnc3ccccn23": 1464,
      "Oc1ccccc1F": 1465,
      "n3CC": 1466,
      "cc5": 1467,
      "OCc2cc": 1468,
      "CNc2cccc": 1469,
      "n1CCNC": 1470,
      "2CCN1CC2": 1471,
      "Cn1nnc": 1472,
      "ccc2C1": 1473,
      "1COCCO1": 1474,
      "c1nnc2n1CCC2": 1475,
      "1c1c": 1476,
      "NNc1ccc": 1477,
      "C23CC4CC": 1478,
      "N2CCS": 1479,
      "Cc2cn": 1480,
      "c1nc2ccccc2o1": 1481,
      "c2nc3ccccc3n2C": 1482,
      "cccc3F": 1483,
      "Cn2cncn2": 1484,
      "Nc2ncnc": 1485,
      "c3nnnn3C": 1486,
      "2SCC": 1487,
      "CCc2cc": 1488,
      "CC2CCCC2": 1489,
      "1CCCCCCC1": 1490,
      "CCn1cnnc1": 1491,
      "2c2cccs2": 1492,
      "co2": 1493,
      "oc2ccc": 1494,
      "NCc1ncc": 1495,
      "NCc1ccccc1F": 1496,
      "c2ccccc2S1": 1497,
      "CC2CCC2": 1498,
      "CCCCCC1": 1499,
      "OCO5": 1500,
      "Cn1cnc2c": 1501,
      "ccc3o2": 1502,
      "Nc1ncnc": 1503,
      "N4CCCCC4": 1504,
      "c2cscn2": 1505,
      "Oc1c": 1506,
      "CCCCO": 1507,
      "Cc1cccn2c": 1508,
      "c4ncc": 1509,
      "COC1CC": 1510,
      "(/[": 1511,
      "Cc1ccccc1OC": 1512,
      "CCSC3": 1513,
      "Cn1cnnc1": 1514,
      "ccc3n2": 1515,
      "cccc32": 1516,
      "nc2n": 1517,
      "c3ccccc13": 1518,
      "N1CCSCC1": 1519,
      "CSc1ccccc1": 1520,
      "N2CCSCC2": 1521,
      "Cc1cnc2c": 1522,
      "2CCCN2S": 1523,
      "oc3c2": 1524,
      "CCc1": 1525,
      "COc3ccccc3": 1526,
      "N1CCc2": 1527,
      "n3c2": 1528,
      "Nc1ccc2oc": 1529,
      "ncccc12": 1530,
      "c1nccn1C": 1531,
      "c3ncnc4": 1532,
      "Cn1cccc1": 1533,
      "Cc1ncccc1NC": 1534,
      "Cc1nc2ccccc2s1": 1535,
      "2CCCc3cccc1c32": 1536,
      "2c1ccc": 1537,
      "2SC": 1538,
      "Cn3cc": 1539,
      "Nc3ccccc32": 1540,
      "cccc12": 1541,
      "2CCc3ccccc32": 1542,
      "OC2CCC2": 1543,
      "N1CCCCC": 1544,
      "c2nc3n": 1545,
      "NCCc1cccc": 1546,
      "N1Cc1ccccc1": 1547,
      "CCCCCC2": 1548,
      "SCc2cc": 1549,
      "Cc1ncn": 1550,
      "c2ccccn2c1": 1551,
      "CCOc1ccc2nc": 1552,
      "n3ccccc3n2": 1553,
      "cc2c1C": 1554,
      "nnc1C": 1555,
      "NCCc1cccs1": 1556,
      "ccc2Br": 1557,
      "c4ccccc4Cl": 1558,
      "sc1NC": 1559,
      "cccc3Cl": 1560,
      "1CSc2ccccc21": 1561,
      "NCc2cccs2": 1562,
      "CCN2CCOCC2": 1563,
      "N2CCNC": 1564,
      "Cc1nsc": 1565,
      "Cc1coc": 1566,
      "Cc1cccc2c": 1567,
      "N3CCO": 1568,
      "CCSCC2": 1569,
      "ccc3F": 1570,
      "Cc3ccccc3Cl": 1571,
      "c1cccc2cc": 1572,
      "CSc1nnnn1": 1573,
      "3CN": 1574,
      "Cc3ccc4c": 1575,
      "COCCOc1ccc": 1576,
      "ccc2s1": 1577,
      "nc3n": 1578,
      "c4ccc5c": 1579,
      "n1cnnn1": 1580,
      "Cc3ccccc3C2": 1581,
      "1COc2ccc": 1582,
      "Nc1cccnc1Cl": 1583,
      "Cn1nnnc1": 1584,
      "oc3cc": 1585,
      "CCc1ccc2c": 1586,
      "CCCc2ccccc2": 1587,
      "n2n": 1588,
      "NCCc2ccccc2": 1589,
      "nc3c2c": 1590,
      "cc4c3": 1591,
      "Cn1ncc2c": 1592,
      "2c2cc": 1593,
      "cnc23": 1594,
      "c1ccc2cc": 1595,
      "COc1ccc2ccccc2c1": 1596,
      "CCn1ncc": 1597,
      "Nc1ccccc1Br": 1598,
      "c3sc4c": 1599,
      "1CSCCS1": 1600,
      "oc2c": 1601,
      "CCCc1ccccc1": 1602,
      "n2Cc2ccccc2": 1603,
      "c3ccccc31": 1604,
      "nnc12": 1605,
      "CSc2n": 1606,
      "N2CCc3cc": 1607,
      "COc1ccccc1N1C": 1608,
      "c4ccccc4O3": 1609,
      "c2ncco2": 1610,
      "Cc2cc3": 1611,
      "n3cnnn3": 1612,
      "1Cc2ccccc2S1": 1613,
      "n2ccccc2n1": 1614,
      "c1scnc1C1CC1": 1615,
      "1Cl": 1616,
      "Oc2c": 1617,
      "Oc2cccnc2": 1618,
      "oc3C": 1619,
      "c2c1c": 1620,
      "CCCc1nnc": 1621,
      "c2ccccc2S": 1622,
      "c1ccccc1OCC": 1623,
      "nc1Cl": 1624,
      "Nc1ccncc1": 1625,
      "1c1cccnc1": 1626,
      "nn3c2": 1627,
      "c1ccncc1Cl": 1628,
      "+])([": 1629,
      "c3ccn": 1630,
      "OCc2cccc": 1631,
      "cc2n1": 1632,
      "Cc1ccoc1": 1633,
      "CNC1": 1634,
      "N2CCNC2": 1635,
      "nc1NC": 1636,
      "C3CCC3": 1637,
      "N2CCCc3ccccc32": 1638,
      "c2ncccc12": 1639,
      "cccc2s1": 1640,
      "noc3C": 1641,
      "Cn2ccc": 1642,
      "Cc1occc1": 1643,
      "Cc1nc2ccccc2c": 1644,
      "SCC3": 1645,
      "CCSCC": 1646,
      "NCc3cccc": 1647,
      "c2cc1OC": 1648,
      "cc1N1C": 1649,
      "c2cccnc12": 1650,
      "1CCCc2ccc": 1651,
      "N1CCCc2ccccc21": 1652,
      "Nc1cc2c": 1653,
      "Cn1cccc1C": 1654,
      "c2cc3cccc": 1655,
      "ccccc21": 1656,
      "NCc2ccnc": 1657,
      "Cc2cccc3ccccc23": 1658,
      "Cc2": 1659,
      "onc": 1660,
      "ccn": 1661,
      "1CCCCN1": 1662,
      "Clc1cccc": 1663,
      "OCc1cc": 1664,
      "n21": 1665,
      "CCS1": 1666,
      "c2sccc21": 1667,
      "1c1ccccc1Cl": 1668,
      "Nc4ccccc4": 1669,
      "cnc": 1670,
      "CCc2ccccc21": 1671,
      "CCCCOc1ccc": 1672,
      "COCCOC": 1673,
      "OCc3ccc": 1674,
      "OCc2cccnc2": 1675,
      "c2ccccc2N1": 1676,
      "1CCCc2cccnc21": 1677,
      "CSCc1ccc": 1678,
      "CSc2nn": 1679,
      "Cc1nc2n": 1680,
      "n2cnc3ccccc32": 1681,
      "c3ncn": 1682,
      "3CCCN3C": 1683,
      "c1nc2ccccc2n1CC": 1684,
      "n4cccn4": 1685,
      "c1cccc2c1": 1686,
      "1OC1CCCC1": 1687,
      "c3cccc4ccccc34": 1688,
      "Cc1cscc1C": 1689,
      "CCNc1cc": 1690,
      "NCCc2c": 1691,
      "OCC2CC2": 1692,
      "CN2CCOC": 1693,
      "c1nnc2c": 1694,
      "c2cnn3C": 1695,
      "sc2c1CC": 1696,
      "12CCc1ccccc12": 1697,
      "5CC": 1698,
      "Cc2n": 1699,
      "Cc2ncc": 1700,
      "cn2C": 1701,
      "CCC1CCCC1": 1702,
      "1CCc2cc": 1703,
      "ncnc21": 1704,
      "CCN1CCC": 1705,
      "CSc3nnc": 1706,
      "3C4": 1707,
      "c2cncnc2": 1708,
      "CCc1ccccn1": 1709,
      "c2OC": 1710,
      "NCc1ccncc1": 1711,
      "c4C": 1712,
      "OCCCC": 1713,
      "COc1ccnc": 1714,
      "1CN1CCOCC1": 1715,
      "cc43": 1716,
      "cccc3s2": 1717,
      "c3nc4ccc": 1718,
      "Cn2ccnc2": 1719,
      "CCCn1ccnn1": 1720,
      "21C": 1721,
      "Cn3": 1722,
      "Nc3ccccc3F": 1723,
      "nc2ccccn12": 1724,
      "oc3ccccc32": 1725,
      "c1c2ccccc2": 1726,
      "COc2ccccc2C": 1727,
      "n1nnc": 1728,
      "c43": 1729,
      "2CCC3": 1730,
      "Cc1ncnn1C": 1731,
      "COc1ccccc1F": 1732,
      "n2ccsc2n1": 1733,
      "c1nc2ccccc2n1": 1734,
      "1SCCC": 1735,
      "oc2c1C": 1736,
      "nc4ccccc43": 1737,
      "23CC": 1738,
      "CCCCCNC": 1739,
      "2CCc3c": 1740,
      "2CSCC": 1741,
      "n32": 1742,
      "N1Cc1ccc": 1743,
      "CCn1n": 1744,
      "nc3n2": 1745,
      "ccc3Cl": 1746,
      "Nc2ccccc2OC": 1747,
      "Cn2nn": 1748,
      "c1cc2ccccc2oc1": 1749,
      "nnc3s2": 1750,
      "23C": 1751,
      "2CN1C": 1752,
      "4c": 1753,
      "Nc4cccc": 1754,
      "nn2c": 1755,
      "COCCO": 1756,
      "1CCc2nc": 1757,
      "1CCc2cccnc21": 1758,
      "C1S": 1759,
      "C3CCOCC3": 1760,
      "n2ccccc12": 1761,
      "c1cscn1": 1762,
      "c3sccc32": 1763,
      "Cc1ccncc1NC": 1764,
      "1c1ccccc1C": 1765,
      "43": 1766,
      "Sc2nc": 1767,
      "ns1": 1768,
      "ccc2c": 1769,
      "c2O1": 1770,
      "NCc3ccc4c": 1771,
      "NC2CCCCCC2": 1772,
      "1CSC": 1773,
      "CSc1cc": 1774,
      "COc1ccccc1CC": 1775,
      "c3nccc": 1776,
      "c1cc2ccc": 1777,
      "cccc2c1": 1778,
      "C4CCCCC4": 1779,
      "nc4c": 1780,
      "N4CCN": 1781,
      "2COc3ccccc32": 1782,
      "c1sccc1C": 1783,
      "1c2cc": 1784,
      "NCCOc1ccc": 1785,
      "Sc1ccccn1": 1786,
      "1CCc2sc": 1787,
      "C12": 1788,
      "C12CC": 1789,
      "c1nccc": 1790,
      "Cc1ccon1": 1791,
      "N2CCc3c": 1792,
      "NCCc1nc": 1793,
      "NCC1CC1": 1794,
      "Cc1ccccc1Br": 1795,
      "c2c1CCC2": 1796,
      "2CCCCCCC2": 1797,
      "Nc2ccccn2": 1798,
      "cn23": 1799,
      "1CSCCO1": 1800,
      "NCCN1CCOCC1": 1801,
      "2Nc3ccc": 1802,
      "3OC": 1803,
      "Nc3nnc": 1804,
      "O4": 1805,
      "coc2c1": 1806,
      "ccn1CC": 1807,
      "NCc2ccccn2": 1808,
      "COCCCN1C": 1809,
      "1CCNC": 1810,
      "C2S": 1811,
      "N1CCNC": 1812,
      "CSc1ccccc1NC": 1813,
      "ccc1CNC": 1814,
      "3CCCCCC3": 1815,
      "COc1ccc2oc": 1816,
      "Cc1ccccc1N1C": 1817,
      "COc1ccccc1CN": 1818,
      "Nc1ccccc1N1CCCC1": 1819,
      "1Oc2ccc": 1820,
      "c1cnc2c": 1821,
      "1NS": 1822,
      "4CCOCC4": 1823,
      "NNS": 1824,
      "nc3ccc": 1825,
      "CCCCOC": 1826,
      "c3c4c": 1827,
      "n1Cc1ccco1": 1828,
      "2CCc3ccccc3C2": 1829,
      "OC1CCCC1": 1830,
      "Cc1ccc2oc": 1831,
      "N1CCc2sccc2C1": 1832,
      "N2CCc3ccc": 1833,
      "Cc1nnc2n1": 1834,
      "COc1ccccc1N": 1835,
      "Cc1cc2cc": 1836,
      "c3nnnn3": 1837,
      "n1nnc2ccccc21": 1838,
      "Cn1ncc2c1CCC": 1839,
      "2N1": 1840,
      "NCc2ncc": 1841,
      "NCc2ccccc2Cl": 1842,
      "ncnc2s1": 1843,
      "OCc2ccccc2F": 1844,
      "c1nn2c": 1845,
      "CCOc2ccccc2": 1846,
      "CCNc1nc": 1847,
      "CNC2": 1848,
      "C1CCS": 1849,
      "Cc1ncccc1C": 1850,
      "Cn2nnc": 1851,
      "COc1cccc2c1OC": 1852,
      "2c2ccccc2F": 1853,
      "Cc2nccs2": 1854,
      "NNc1cccc": 1855,
      "c1ccc2oc": 1856,
      "NCc2ccccc2C": 1857,
      "c3Cl": 1858,
      "CCCc1noc": 1859,
      "c1ccccc1C2": 1860,
      "1CCCS1": 1861,
      "1CCCOC1": 1862,
      "c4nnc": 1863,
      "Cc1ccc2cc": 1864,
      "nnn1C": 1865,
      "2CCCc3": 1866,
      "nc2c1C": 1867,
      "NCCOC": 1868,
      "n34": 1869,
      "COc1ccccc1OCC": 1870,
      "CCS2": 1871,
      "Nc2ccnn2": 1872,
      "n4C": 1873,
      "CCc1ccsc1CNC": 1874,
      "Cc2ccccc21": 1875,
      "CCCN1CC": 1876,
      "2CCCCN": 1877,
      "1Cc1cccc": 1878,
      "1C1CCCCC1": 1879,
      "c3ccccc3Br": 1880,
      "Brc1ccc": 1881,
      "SCc2ccccc2": 1882,
      "nn2c1": 1883,
      "CCc1ccco1": 1884,
      "NCCCn1cc": 1885,
      "sc1Br": 1886,
      "Cc2ccon2": 1887,
      "1COc2ccccc2C1": 1888,
      "N4C": 1889,
      "sc2c1CCC2": 1890,
      "Nc3ncnn32": 1891,
      "1c2ccccc2": 1892,
      "SC3": 1893,
      "COc1ncccc1C": 1894,
      "c3ccc4ccccc4c3": 1895,
      "c2ccccc2NC1": 1896,
      "CNCC": 1897,
      "CN3CCC": 1898,
      "cc2ccccc21": 1899,
      "c1ncccn1": 1900,
      "2CNC": 1901,
      "CSC3": 1902,
      "cc34": 1903,
      "ccc2N": 1904,
      "c2cccc3cccnc23": 1905,
      "Sc1nnnn1": 1906,
      "1NN": 1907,
      "Cn3nc": 1908,
      "cnn2C": 1909,
      "CCn2cc": 1910,
      "NC1C": 1911,
      "c2ccc3ccccc3n2": 1912,
      "CCCc1n": 1913,
      "c1cccn1": 1914,
      "C12CCC2": 1915,
      "OC2CCCCC2": 1916,
      "CSc1ccccc1C": 1917,
      "NCC3": 1918,
      "NCCc1ccccn1": 1919,
      "C2CCSCC2": 1920,
      "CCCCc1ccc": 1921,
      "nc3sc": 1922,
      "ncc2ccccc12": 1923,
      "ccc3OC": 1924,
      "cc4c": 1925,
      "NC12CC3CC": 1926,
      "c1cccc2ncccc12": 1927,
      "c1cccnc1Cl": 1928,
      "c3ncccc3C": 1929,
      "c2cccc3c2": 1930,
      "2CSc3ccccc32": 1931,
      "2Nc3c": 1932,
      "NNc2ccc": 1933,
      "Oc2ccc3c": 1934,
      "Oc1ccccc1Cl": 1935,
      "c2ccc3nnc": 1936,
      "cc1I": 1937,
      "1CCOC": 1938,
      "c2ncc3c": 1939,
      "nc2N": 1940,
      "n3ncc": 1941,
      "Cn1cccc": 1942,
      "c2nccnc2c1": 1943,
      "N2c3ccccc3C": 1944,
      "3CCCc4": 1945,
      "1CCSc2ccc": 1946,
      "Cc1nccn1C": 1947,
      "2CN3CCCC": 1948,
      "Nc1nncs1": 1949,
      "Cc3csc": 1950,
      "Nc3c2c": 1951,
      "1Br": 1952,
      "1c2ccsc2": 1953,
      "CCc2cccc": 1954,
      "c2s1": 1955,
      "1CCc2": 1956,
      "ccc2OC1": 1957,
      "C2CCCCCC2": 1958,
      "N3CCc4ccccc43": 1959,
      "c2nnc3n2": 1960,
      "cn2n1": 1961,
      "n3ccsc3n2": 1962,
      "c2oc3c": 1963,
      "c2nnnn2C2CC2": 1964,
      "c1ocnc1C": 1965,
      "3COc4ccccc4O3": 1966,
      "2Cc3ccccc3S2": 1967,
      "2N1C": 1968,
      "CCc3ccccc32": 1969,
      "NCc3cc": 1970,
      "NCc1nnc": 1971,
      "CCCc2ccccc21": 1972,
      "COc3cccc": 1973,
      "COc2c": 1974,
      "COCCn1nc": 1975,
      "CN1c1ccccc1": 1976,
      "Cc1ccn2c": 1977,
      "N1CCc2nc": 1978,
      "N2CCCCC": 1979,
      "C1CCc2cc": 1980,
      "C1CCCCCC1": 1981,
      "OCC1CC1": 1982,
      "ccc34": 1983,
      "n4nc": 1984,
      "N4CCCC": 1985,
      "c1sc2ccccc2c1": 1986,
      "c4ncccn4": 1987,
      "1O2": 1988,
      "Cc3ccncc3": 1989,
      "Nc2cnc": 1990,
      "Nc1nc2ccccc2s1": 1991,
      "Sc2ccccc21": 1992,
      "scc": 1993,
      "NCc1ccccc1C": 1994,
      "NC1CCCCCCC1": 1995,
      "c3F": 1996,
      "OCc2ccccn2": 1997,
      "c2ccccc2n2c": 1998,
      "c3ccccc3n12": 1999,
      "CSc1nc2ccccc2c": 2000,
      "ccc1N1CCOCC1": 2001,
      "cc3n2": 2002,
      "COc1ccccc1O": 2003,
      "NCCCOC": 2004,
      "Cc1nnc2ccc": 2005,
      "Cc3ccccc3C": 2006,
      "c1cccc2sc": 2007,
      "c1sc2nc": 2008,
      "c1ccsc1NC": 2009,
      "CCc1nsc": 2010,
      "Cc3cnc": 2011,
      "Cc3cccc4": 2012,
      "NCc2cn": 2013,
      "CONC": 2014,
      "OCc1cccc": 2015,
      "nc1CC": 2016,
      "N2CCCS2": 2017,
      "c2ncccc2Cl": 2018,
      "C4CCCC4": 2019,
      "c1occc1Br": 2020,
      "CCOCC1CC1": 2021,
      "n1ncc2c": 2022,
      "1c2ccc": 2023,
      "2c2ccc3c": 2024,
      "Nc1": 2025,
      "Oc2ccccc2C": 2026,
      "CCCc1nn": 2027,
      "CCC1CC1": 2028,
      "1CCc2ccc": 2029,
      "n2c3c": 2030,
      "C2CN": 2031,
      "COCc1ccccc1": 2032,
      "cc3OC": 2033,
      "nc2c1nc": 2034,
      "Cc1ccccc1CC": 2035,
      "SCc2c": 2036,
      "CCSCC1": 2037,
      "N2c2ccc": 2038,
      "Nc2ccc3nc": 2039,
      "c2nncn2C": 2040,
      "CN2CCS": 2041,
      "ccc3O": 2042,
      "ccc3n2C": 2043,
      "Cc1cccc2nc": 2044,
      "c3sccc3": 2045,
      "c2oc3ccc": 2046,
      "n2ncc3c": 2047
    },
    "merges": [
      [
        "c",
        "c"
      ],
      [
        "C",
        "C"
      ],
      [
        "c",
        "1"
      ],
      [
        "(",
        "="
      ],
      [
        "c",
        "2"
      ],
      [
        "c1",
        "cc"
      ],
      [
        "]",
        "("
      ],
      [
        "@",
        "@"
      ],
      [
        "N",
        "C"
      ],
      [
        "c2",
        "cc"
      ],
      [
        "c",
        "3"
      ],
      [
        "CC",
        "C"
      ],
      [
        "c1cc",
        "c"
      ],
      [
        ")",
        "["
      ],
      [
        "cc",
        "1"
      ],
      [
        "N",
        "H"
      ],
      [
        "+",
        "]"
      ],
      [
        "c1cc",
        "cc"
      ],
      [
        "C",
        "O"
      ],
      [
        "1",
        "CC"
      ],
      [
        "c2cc",
        "cc"
      ],
      [
        "n",
        "1"
      ],
      [
        "C",
        "l"
      ],
      [
        "n",
        "c"
      ],
      [
        "C",
        "1"
      ],
      [
        "c3",
        "cc"
      ],
      [
        "2",
        "CC"
      ],
      [
        "O",
        "C"
      ],
      [
        "CC",
        "1"
      ],
      [
        "c2cc",
        "c"
      ],
      [
        "c2cccc",
        "c2"
      ],
      [
        "c1cccc",
        "c1"
      ],
      [
        ")",
        "("
      ],
      [
        "(",
        "-"
      ],
      [
        "C",
        "N"
      ],
      [
        "(",
        "["
      ],
      [
        "cc",
        "2"
      ],
      [
        "n",
        "2"
      ],
      [
        "-",
        "]"
      ],
      [
        ")",
        "(="
      ],
      [
        "1",
        "C"
      ],
      [
        "n",
        "H"
      ],
      [
        "C",
        "2"
      ],
      [
        "CC",
        "2"
      ],
      [
        "c1",
        "n"
      ],
      [
        "1",
        "CCC"
      ],
      [
        "c3cc",
        "cc"
      ],
      [
        "-]",
        ")"
      ],
      [
        "c1",
        "c"
      ],
      [
        "c2",
        "c"
      ],
      [
        "C",
        "c1ccc"
      ],
      [
        "+",
        "]("
      ],
      [
        "NH",
        "2"
      ],
      [
        "CC",
        "O"
      ],
      [
        ")",
        "="
      ],
      [
        "c3cccc",
        "c3"
      ],
      [
        "2",
        "C"
      ],
      [
        "CC",
        "N"
      ],
      [
        "c",
        "4"
      ],
      [
        "C",
        "c1cc"
      ],
      [
        "N",
        "1CC"
      ],
      [
        "n",
        "n"
      ],
      [
        "CO",
        "c1ccc"
      ],
      [
        "2",
        "CCC"
      ],
      [
        "s",
        "1"
      ],
      [
        "B",
        "r"
      ],
      [
        "C",
        "NC"
      ],
      [
        "C",
        "S"
      ],
      [
        "c3cc",
        "c"
      ],
      [
        "N",
        "2CC"
      ],
      [
        "c2",
        "n"
      ],
      [
        "cc",
        "c1"
      ],
      [
        "+]",
        "(="
      ],
      [
        "c1",
        "nc"
      ],
      [
        "CO",
        "C"
      ],
      [
        "o",
        "1"
      ],
      [
        "cc",
        "3"
      ],
      [
        "3",
        "CC"
      ],
      [
        "c1",
        "C"
      ],
      [
        "n",
        "c2"
      ],
      [
        "cc",
        "cc"
      ],
      [
        "N",
        "CC"
      ],
      [
        "C",
        "1CC"
      ],
      [
        "n",
        "c1"
      ],
      [
        "n",
        "3"
      ],
      [
        "c3",
        "c"
      ],
      [
        "+]",
        "["
      ],
      [
        "N",
        "c1ccc"
      ],
      [
        "cc",
        "c"
      ],
      [
        "C",
        "c1n"
      ],
      [
        "CC",
        "3"
      ],
      [
        "](",
        "["
      ],
      [
        "NH",
        "3"
      ],
      [
        "s",
        "2"
      ],
      [
        "C",
        "c1c"
      ],
      [
        "c2",
